ConnectTest/src/Documents/messageLogs/messageLogs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>messageLogs</name>
  <registerRecords>AccumulationRegister.pushStatus</registerRecords>
  <attributes>
    <name>error</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>informationChannel</name>
    <type>
      <types>EnumRef.informationChannels</types>
    </type>
  </attributes>
  <attributes>
    <name>message</name>
    <type>
      <types>CatalogRef.messages</types>
    </type>
  </attributes>
  <attributes>
    <name>messageStatus</name>
    <type>
      <types>EnumRef.messageStatuses</types>
    </type>
  </attributes>
  <attributes>
    <name>recordDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>request</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>response</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>token</name>
    <type>
      <types>CatalogRef.tokens</types>
    </type>
  </attributes>
</mdclass:Document>

ConnectTest/src/AccumulationRegisters/pushStatus/pushStatus.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>pushStatus</name>
  <resources>
    <name>amount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>user</name>
    <type>
      <types>CatalogRef.users</types>
    </type>
  </dimensions>
  <dimensions>
    <name>informationChannel</name>
    <type>
      <types>EnumRef.informationChannels</types>
    </type>
  </dimensions>
  <dimensions>
    <name>message</name>
    <type>
      <types>CatalogRef.messages</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ConnectTest/src/Enums/informationChannels/informationChannels.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>informationChannels</name>
  <enumValues>
    <name>pushEmployee</name>
  </enumValues>
  <enumValues>
    <name>pushCustomer</name>
  </enumValues>
  <enumValues>
    <name>sms</name>
  </enumValues>
  <enumValues>
    <name>email</name>
  </enumValues>
</mdclass:Enum>

ConnectTest/src/Enums/messageStatuses/messageStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
	<name>messageStatuses</name>
	<enumValues>
		<name>sent</name>
	</enumValues>
	<enumValues>
		<name>notSent</name>
	</enumValues>
	<enumValues>
		<name>delivered</name>
	</enumValues>
	<enumValues>
		<name>notDelivered</name>
	</enumValues>
	<enumValues>
		<name>read</name>
	</enumValues>
	<enumValues>
		<name>undefined</name>
	</enumValues>
</mdclass:Enum>

ConnectTest/src/Documents/messageLogs/ObjectModule.bsl
Procedure Posting(Cancel, PostingMode)

	If (informationChannel = enums.informationChannels.pushCustomer Or informationChannel
		= enums.informationChannels.pushEmployee) And (messageStatus = enums.messageStatuses.sent Or messageStatus
		= enums.messageStatuses.read) Then
		RegisterRecords.pushStatus.Write = True;
		RegisterRecord = RegisterRecords.pushStatus.Add();
		RegisterRecord.user = message.user;
		RegisterRecord.informationChannel = informationChannel;
		RegisterRecord.message = message;
		RegisterRecord.Period = Date;
		RegisterRecord.amount = 1;
		If messageStatus = enums.messageStatuses.sent Then
			RegisterRecord.RecordType = AccumulationRecordType.Receipt;
		ElsIf messageStatus = enums.messageStatuses.read Then
			RegisterRecord.RecordType = AccumulationRecordType.Expense;
		EndIf;
	EndIf;
EndProcedure
